bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32G4A1xx.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="I2C1">
         <name>I2C2</name>
         <baseAddress>0x40005800</baseAddress>
         <interrupt>
            <name>WWDG</name>
            <description>Window Watchdog interrupt</description>
            <value>0</value>
         </interrupt>
         <interrupt>
            <name>I2C2_EV</name>
            <description>I2C2_EV</description>
            <value>33</value>
         </interrupt>
         <interrupt>
            <name>I2C2_ER</name>
            <description>I2C2_ER</description>
            <value>34</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="I2C1">
         <name>I2C3</name>
         <baseAddress>0x40007800</baseAddress>
         <interrupt>
            <name>I2C3_EV</name>
            <description>I2C3_EV</description>
            <value>92</value>
         </interrupt>
         <interrupt>
            <name>I2C3_ER</name>
            <description>I2C3_ER</description>
            <value>93</value>
         </interrupt>
      </peripheral>     
      <peripheral>
         <name>FLASH</name>
         <description>Flash</description>
         <groupName>Flash</groupName>
         <baseAddress>0x40022000</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>FLASH</name>
            <description>FLASH</description>
            <value>4</value>
         </interrupt>
         <registers>
            <register>
               <name>ACR</name>
               <displayName>ACR</displayName>
               <description>Access control register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000600</resetValue>
               <fields>
                  <field>
                     <name>LATENCY</name>
                     <description>Latency</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRFTEN</name>
                     <description>Prefetch enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ICEN</name>
                     <description>Instruction cache enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DCEN</name>
                     <description>Data cache enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ICRST</name>
                     <description>Instruction cache reset</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DCRST</name>
                     <description>Data cache reset</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RUN_PD</name>
                     <description>Flash Power-down mode during Low-power               run mode</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SLEEP_PD</name>
                     <description>Flash Power-down mode during Low-power               sleep mode</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_SWEN</name>
                     <description>Debug software enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PDKEYR</name>
               <displayName>PDKEYR</displayName>
               <description>Power down key register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PDKEYR</name>
                     <description>RUN_PD in FLASH_ACR key</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>KEYR</name>
               <displayName>KEYR</displayName>
               <description>Flash key register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>KEYR</name>
                     <description>KEYR</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OPTKEYR</name>
               <displayName>OPTKEYR</displayName>
               <description>Option byte key register</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OPTKEYR</name>
                     <description>Option byte key</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SR</name>
               <displayName>SR</displayName>
               <description>Status register</description>
               <addressOffset>0x10</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EOP</name>
                     <description>End of operation</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>OPERR</name>
                     <description>Operation error</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PROGERR</name>
                     <description>Programming error</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>WRPERR</name>
                     <description>Write protected error</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PGAERR</name>
                     <description>Programming alignment               error</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SIZERR</name>
                     <description>Size error</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PGSERR</name>
                     <description>Programming sequence error</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>MISERR</name>
                     <description>Fast programming data miss               error</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>FASTERR</name>
                     <description>Fast programming error</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RDERR</name>
                     <description>PCROP read error</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>OPTVERR</name>
                     <description>Option validity error</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BSY</name>
                     <description>Busy</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CR</name>
               <displayName>CR</displayName>
               <description>Flash control register</description>
               <addressOffset>0x14</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0xC0000000</resetValue>
               <fields>
                  <field>
                     <name>PG</name>
                     <description>Programming</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PER</name>
                     <description>Page erase</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MER1</name>
                     <description>Bank 1 Mass erase</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PNB</name>
                     <description>Page number</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>STRT</name>
                     <description>Start</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OPTSTRT</name>
                     <description>Options modification start</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSTPG</name>
                     <description>Fast programming</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOPIE</name>
                     <description>End of operation interrupt               enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERRIE</name>
                     <description>Error interrupt enable</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDERRIE</name>
                     <description>PCROP read error interrupt               enable</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OBL_LAUNCH</name>
                     <description>Force the option byte               loading</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SEC_PROT1</name>
                     <description>SEC_PROT1</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OPTLOCK</name>
                     <description>Options Lock</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK</name>
                     <description>FLASH_CR Lock</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ECCR</name>
               <displayName>ECCR</displayName>
               <description>Flash ECC register</description>
               <addressOffset>0x18</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADDR_ECC</name>
                     <description>ECC fail address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>19</bitWidth>
                     <access>read-only</access>
                  </field>
				  <field>
                     <name>BK_ECC</name>  
                     <description>BK_ECC</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>SYSF_ECC</name>
                     <description>SYSF_ECC</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>ECCIE</name>
                     <description>ECCIE</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>        
                  </field>
				  <field>
                     <name>ECCC2</name>
                     <description>ECC correction</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>        
                  </field>
				   <field>
                     <name>ECCD2</name>
                     <description>ECC2 detection</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>        
                  </field>										 
                  <field>
                     <name>ECCC</name>
                     <description>ECC correction</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ECCD</name>
                     <description>ECC detection</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>OPTR</name>
               <displayName>OPTR</displayName>
               <description>Flash option register</description>
               <addressOffset>0x20</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0xF0000000</resetValue>
               <fields>
                  <field>
                     <name>RDP</name>
                     <description>Read protection level</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>BOR_LEV</name>
                     <description>BOR reset Level</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>nRST_STOP</name>
                     <description>nRST_STOP</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>nRST_STDBY</name>
                     <description>nRST_STDBY</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>nRST_SHDW</name>
                     <description>nRST_SHDW</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IDWG_SW</name>
                     <description>Independent watchdog               selection</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IWDG_STOP</name>
                     <description>Independent watchdog counter freeze in               Stop mode</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IWDG_STDBY</name>
                     <description>Independent watchdog counter freeze in               Standby mode</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WWDG_SW</name>
                     <description>Window watchdog selection</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>nBOOT1</name>
                     <description>Boot configuration</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRAM2_PE</name>
                     <description>SRAM2 parity check enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRAM2_RST</name>
                     <description>SRAM2 Erase when system               reset</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>nSWBOOT0</name>
                     <description>nSWBOOT0</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>nBOOT0</name>
                     <description>nBOOT0</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NRST_MODE</name>
                     <description>NRST_MODE</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>IRHEN</name>
                     <description>IRHEN</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PCROP1SR</name>
               <displayName>PCROP1SR</displayName>
               <description>Flash Bank 1 PCROP Start address           register</description>
               <addressOffset>0x24</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0xFFFF0000</resetValue>
               <fields>
                  <field>
                     <name>PCROP1_STRT</name>
                     <description>Bank 1 PCROP area start               offset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>15</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PCROP1ER</name>
               <displayName>PCROP1ER</displayName>
               <description>Flash Bank 1 PCROP End address           register</description>
               <addressOffset>0x28</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0FFF0000</resetValue>
               <fields>
                  <field>
                     <name>PCROP1_END</name>
                     <description>Bank 1 PCROP area end               offset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>15</bitWidth>
                  </field>
                  <field>
                     <name>PCROP_RDP</name>
                     <description>PCROP area preserved when RDP level               decreased</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
