bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32G4A1xx.svd
         </registers>
      </peripheral>
	  <peripheral>
      <name>NVIC_STIR</name>
      <description>Nested vectored interrupt
      controller</description>
      <groupName>NVIC</groupName>
      <baseAddress>0xE000EF00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x5</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>STIR</name>
          <displayName>STIR</displayName>
          <description>Software trigger interrupt
          register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTID</name>
              <description>Software generated interrupt
              ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
      <peripheral>
         <name>FPU_CPACR</name>
         <description>Floating point unit CPACR</description>
         <groupName>FPU</groupName>
         <baseAddress>0xE000ED88</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x5</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CPACR</name>
               <displayName>CPACR</displayName>
               <description>Coprocessor access control           register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000000</resetValue>
               <fields>
                  <field>
                     <name>CP</name>
                     <description>CP</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>SCB_ACTLR</name>
         <description>System control block ACTLR</description>
         <groupName>SCB</groupName>
         <baseAddress>0xE000E008</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x5</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>ACTRL</name>
               <displayName>ACTRL</displayName>
               <description>Auxiliary control register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DISMCYCINT</name>
                     <description>DISMCYCINT</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DISDEFWBUF</name>
                     <description>DISDEFWBUF</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DISFOLD</name>
                     <description>DISFOLD</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DISFPCA</name>
                     <description>DISFPCA</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DISOOFP</name>
                     <description>DISOOFP</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>FDCAN</name>
         <description>FDCAN</description>
         <groupName>FDCAN</groupName>
         <baseAddress>0x4000A400</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CREL</name>
               <displayName>CREL</displayName>
               <description>FDCAN Core Release Register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x32141218</resetValue>
               <fields>
                  <field>
                     <name>DAY</name>
                     <description>DAY</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>MON</name>
                     <description>MON</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>YEAR</name>
                     <description>YEAR</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>SUBSTEP</name>
                     <description>SUBSTEP</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>STEP</name>
                     <description>STEP</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>REL</name>
                     <description>REL</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ENDN</name>
               <displayName>ENDN</displayName>
               <description>FDCAN Core Release Register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x87654321</resetValue>
               <fields>
                  <field>
                     <name>ETV</name>
                     <description>ETV</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DBTP</name>
               <displayName>DBTP</displayName>
               <description>This register is only writable if bits           CCCR.CCE and CCCR.INIT are set. The CAN bit time may be           programed in the range of 4 to 25 time quanta. The CAN           time quantum may be programmed in the range of 1 to 1024           FDCAN clock periods. tq = (DBRP + 1) FDCAN clock period.           DTSEG1 is the sum of Prop_Seg and Phase_Seg1. DTSEG2 is           Phase_Seg2. Therefore the length of the bit time is           (programmed values) [DTSEG1 + DTSEG2 + 3] tq or           (functional values) [Sync_Seg + Prop_Seg + Phase_Seg1 +           Phase_Seg2] tq. The Information Processing Time (IPT) is           zero, meaning the data for the next bit is available at           the first clock edge after the sample           point.</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000A33</resetValue>
               <fields>
                  <field>
                     <name>DSJW</name>
                     <description>DSJW</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>DTSEG2</name>
                     <description>DTSEG2</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>DTSEG1</name>
                     <description>DTSEG1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>DBRP</name>
                     <description>DBRP</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TDC</name>
                     <description>TDC</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>TEST</name>
               <displayName>TEST</displayName>
               <description>Write access to the Test Register has to be           enabled by setting bit CCCR[TEST] to 1 . All Test           Register functions are set to their reset values when bit           CCCR[TEST] is reset. Loop Back mode and software control           of Tx pin FDCANx_TX are hardware test modes. Programming           TX differently from 00 may disturb the message transfer           on the CAN bus.</description>
               <addressOffset>0x10</addressOffset>
               <size>0x20</size>              
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LBCK</name>
                     <description>LBCK</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
					 <access>read-write</access>
                  </field>
                  <field>
                     <name>TX</name>
                     <description>TX</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>2</bitWidth>
					 <access>read-write</access>
                  </field>
                  <field>
                     <name>RX</name>
                     <description>RX</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
					 <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>RWD</name>
               <displayName>RWD</displayName>
               <description>The RAM Watchdog monitors the READY output           of the Message RAM. A Message RAM access starts the           Message RAM Watchdog Counter with the value configured by           the RWD[WDC] bits. The counter is reloaded with RWD[WDC]           bits when the Message RAM signals successful completion           by activating its READY output. In case there is no           response from the Message RAM until the counter has           counted down to 0, the counter stops and interrupt flag           IR[WDI] bit is set. The RAM Watchdog Counter is clocked           by the fdcan_pclk clock.</description>
               <addressOffset>0x14</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WDC</name>
                     <description>WDC</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>WDV</name>
                     <description>WDV</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CCCR</name>
               <displayName>CCCR</displayName>
               <description>For details about setting and resetting of           single bits see Software initialization.</description>
               <addressOffset>0x18</addressOffset>
               <size>0x20</size>              
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>INIT</name>
                     <description>INIT</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
					 <access>read-write</access>
                  </field>
                  <field>
                     <name>CCE</name>
                     <description>CCE</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
					 <access>read-write</access>
                  </field>
                  <field>
                     <name>ASM</name>
                     <description>ASM</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
					 <access>read-write</access>
                  </field>
                  <field>
                     <name>CSA</name>
                     <description>CSA</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
					 <access>read-only</access>
                  </field>
                  <field>
                     <name>CSR</name>
                     <description>CSR</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
					 <access>read-write</access>
                  </field>
                  <field>
                     <name>MON</name>
                     <description>MON</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
					 <access>read-write</access>
                  </field>
                  <field>
                     <name>DAR</name>
                     <description>DAR</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
					 <access>read-write</access>
                  </field>
                  <field>
                     <name>TEST</name>
                     <description>TEST</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
					 <access>read-write</access>
                  </field>
                  <field>
                     <name>FDOE</name>
                     <description>FDOE</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
					 <access>read-write</access>
                  </field>
                  <field>
                     <name>BRSE</name>
                     <description>BRSE</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
					 <access>read-write</access>
                  </field>
                  <field>
                     <name>PXHD</name>
                     <description>PXHD</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
					 <access>read-write</access>
                  </field>
                  <field>
                     <name>EFBI</name>
                     <description>EFBI</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
					 <access>read-write</access>
                  </field>
                  <field>
                     <name>TXP</name>
                     <description>TXP</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
					 <access>read-write</access>
                  </field>
                  <field>
                     <name>NISO</name>
                     <description>NISO</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
					 <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>NBTP</name>
               <displayName>NBTP</displayName>
               <description>FDCAN_NBTP</description>
               <addressOffset>0x1C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x06000A03</resetValue>
               <fields>
                  <field>
                     <name>NTSEG2</name>
                     <description>NTSEG2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>NTSEG1</name>
                     <description>NTSEG1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>NBRP</name>
                     <description>NBRP</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>NSJW</name>
                     <description>NSJW</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TSCC</name>
               <displayName>TSCC</displayName>
               <description>FDCAN Timestamp Counter Configuration           Register</description>
               <addressOffset>0x20</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TSS</name>
                     <description>TSS</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>TCP</name>
                     <description>TCP</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TSCV</name>
               <displayName>TSCV</displayName>
               <description>FDCAN Timestamp Counter Value           Register</description>
               <addressOffset>0x24</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TSC</name>
                     <description>TSC</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TOCC</name>
               <displayName>TOCC</displayName>
               <description>FDCAN Timeout Counter Configuration           Register</description>
               <addressOffset>0x28</addressOffset>
               <size>0x20</size>
               <resetValue>0xFFFF0000</resetValue>
               <fields>
                  <field>
                     <name>ETOC</name>
                     <description>ETOC</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TOS</name>
                     <description>TOS</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TOP</name>
                     <description>TOP</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>TOCV</name>
               <displayName>TOCV</displayName>
               <description>FDCAN Timeout Counter Value           Register</description>
               <addressOffset>0x2C</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x0000FFFF</resetValue>
               <fields>
                  <field>
                     <name>TOC</name>
                     <description>TOC</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ECR</name>
               <displayName>ECR</displayName>
               <description>FDCAN Error Counter Register</description>
               <addressOffset>0x40</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TEC</name>
                     <description>TEC</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>REC</name>
                     <description>TREC</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>RP</name>
                     <description>RP</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CEL</name>
                     <description>CEL</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
